# -*- coding: utf-8 -*-
# Pascal's triangle

def triangles():
    L = [1]
    while True:
        yield L # [1]
        L.append(0)
        L = [L[i-1] + L[i] for i in range(len(L))] #前一个数加上后一个数
        # 1st L = [1, 0] 此时列表内有2个数，i的取值范围为[0, 1]
        # 1st 带入L[i-1] + L[i]，则得到[0+1, 1+0]
        # L[0-1]+L[0], L[1-1]+L[1]
        # 0+1, 1+0

        # 2nd L = [1，1，0] 此时列表内有3个数，i的取值范围为[0, 1 ,2]
        # 2nd 带入L[i-1] + L[i]，则得到[0+1, 1+1, 1+0]
        # L[0-1]+L[0], L[1-1]+L[1], L[2-1] + L[2]

        # 3rd [1, 2, 1, 0] 此时列表内有4个数，i的取值范围为[0, 1, 3]
        # 3rd 带入L[i-1] + L[i]，则得到[0+1, 1+2, 2+1, 1+0]


# 期待輸出:
# [1]
# [1, 1]
# [1, 2, 1]
# [1, 3, 3, 1]
# [1, 4, 6, 4, 1]
# [1, 5, 10, 10, 5, 1]
# [1, 6, 15, 20, 15, 6, 1]
# [1, 7, 21, 35, 35, 21, 7, 1]
# [1, 8, 28, 56, 70, 56, 28, 8, 1]
# [1, 9, 36, 84, 126, 126, 84, 36, 9, 1]

print triangles()
